УТ_для_edt/src/Catalogs/CRM_ВариантыЗавершенияБизнесПроцесса/CRM_ВариантыЗавершенияБизнесПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВариантыЗавершенияБизнесПроцесса</name>
  <predefined>
    <items>
      <name>Неудачно</name>
      <description>Неудачно</description>
    </items>
    <items>
      <name>Успешно</name>
      <description>Успешно</description>
    </items>
  </predefined>
  <attributes>
    <name>УспешностьЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ВариантыЗавершенияБизнесПроцесса/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заполняет реквизит УспешностьЗавершения.
//
Процедура ЗаполнитьРеквизитУспешностьЗавершения() Экспорт
	ВариантУспешно = Справочники.CRM_ВариантыЗавершенияБизнесПроцесса.Успешно.ПолучитьОбъект();
	ВариантУспешно.УспешностьЗавершения = Истина;
	ВариантУспешно.Записать();
	ВариантНеудачно = Справочники.CRM_ВариантыЗавершенияБизнесПроцесса.Неудачно.ПолучитьОбъект();
	ВариантНеудачно.УспешностьЗавершения = Ложь;
	ВариантНеудачно.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
